-- Вставляем данные клиентов
INSERT INTO clients (
    deal_number,
    tariff,
    amo_deal_id,
    amo_client_id,
    tg_id,
    avito_id,
    vk_id,
    phone,
    first_name,
    rental_start_date,
    rental_end_date,
    passport_number,
    registration_address,
    last_payment_date
) VALUES
    ('TG-250317-7034', 'Аренда неделя', '27172313', '32325123', '6815090896', NULL, NULL, '79024095662', 'ВАЛЕРИЙ', 
     to_timestamp(1742158800), to_timestamp(1743368400), '11111', 'г. Москва, ул. Ленина, д. 10', '2025-03-30'),
    
    ('Сделка #27200633', 'Аренда неделя', '27200633', '32353665', '1398378347', NULL, NULL, '79250245184', 'АНДРЕЙ',
     to_timestamp(1742245200), to_timestamp(1744664400), '11111', 'г. Москва, ул. Ленина, д. 11', '2025-04-07 19:46'),
    
    ('TG-250320-5582', 'Аренда неделя', '27243509', '32542873', '5193937102', NULL, NULL, '79370135570', 'ВАДИМ',
     to_timestamp(1742418000), to_timestamp(1743022800), '1111', 'г. Москва, ул. Ленина, д. 12', '2025-03-27 21:55'),
    
    ('TG-250320-7450', 'Аренда неделя', '27243695', '32543181', '1262864384', NULL, NULL, '79776076173', 'РОМАН',
     to_timestamp(1742418000), to_timestamp(1744232400), '1111', 'г. Москва, ул. Ленина, д. 13', '2025-04-02'),
    
    ('TG-250322-7320', 'Аренда неделя', '27261349', '32591243', '6216323068', NULL, NULL, '79257761767', 'РОМАН',
     to_timestamp(1742590800), to_timestamp(1743195600), '1111', 'г. Москва, ул. Ленина, д. 14', '2025-03-28'),
    
    ('AVITO-250323-2496', 'Аренда неделя', '27270969', '32600661', NULL, 'u2i-tZK2LCTysS1tw8DDPCQZgA', NULL, '79524617572', 'АЛЕКСЕЙ',
     to_timestamp(1742677200), to_timestamp(1744837200), '1111', 'г. Москва, ул. Ленина, д. 15', '2025-04-08 17:58'),
    
    ('Сделка #27272199', 'Аренда неделя', '27272199', '32601831', '657227676', NULL, NULL, '79005191048', 'ОЛЕГ',
     to_timestamp(1742688000), to_timestamp(1743292800), '1111', 'ТАМБОВСКАЯ ОБЛ. РОССИЯ', '2025-03-30'),
    
    ('TG-250314-5373', 'Аренда неделя', '27132621', '32282515', '7350794393', NULL, NULL, '79015542526', 'БАКЫТБЕК',
     to_timestamp(1741899600), to_timestamp(1743368400), '111', 'г. Москва, ул. Ленина, д. 17', '2025-03-30'),
    
    ('WEB-250325-1664', 'Аренда неделя', '27289389', '32618671', '7671882255', NULL, NULL, '79854721452', 'ВЯЧЕСЛАВ',
     to_timestamp(1742850000), to_timestamp(1743454800), '111', 'г. Москва, ул. Ленина, д. 18', '2025-04-01'),
    
    ('TG-250325-3029', 'Аренда месяц', '27291257', '32595439', '7684068952', NULL, NULL, '79773979898', 'Курбонов Саиджон',
     NULL, NULL, '111', 'г. Москва, ул. Ленина, д. 19', NULL),
    
    ('TG-250327-1092', 'Аренда месяц', '27326851', '32685939', '7843744604', NULL, NULL, '79998588488', 'СЕРГЕЙ',
     to_timestamp(1743022800), to_timestamp(1745701200), '4502123456', 'г. Москва, ул. Ленина, д. 10', '2025-04-26'),
    
    ('TG-250328-1949', 'weekly', '27338709', '32697537', '2087379565', NULL, NULL, NULL, 'Aln',
     NULL, NULL, '9722598849', NULL, NULL),
    
    ('TG-250328-2311', 'Аренда неделя', '27339249', '32698047', '246597618', NULL, NULL, '79859866644', 'Федор',
     to_timestamp(1743109200), to_timestamp(1743714000), '1516708198', 'ул. Острякова, дом № 29, кор. 1', '2025-03-28 17:40'),
    
    ('AVITO-250329-8419', 'rent-to-own', '27340763', '32699499', NULL, 'u2i-hcIMezS3IaSlsQJ~f9WsCA', NULL, '89015053695', 'Великоиваненко Илья Алексеевич',
     NULL, NULL, NULL, NULL, NULL),
    
    ('AVITO-250329-6991', 'Аренда 2 недели', '27344371', '32702967', NULL, 'u2i-0lpEH7qWIh7Eq44VuRiEfg', NULL, '79779149795', 'МАКСИМ',
     to_timestamp(1743282000), to_timestamp(1745096400), '45 20718290', 'УЛ. ОЧАКОВСКАЯ Б. Д. 42, КВ. 6', '2025-04-05 08:11'),
    
    ('AVITO-250329-4781', 'weekly', '27345741', '32704229', NULL, 'u2i-ttuDGWu6SgOJe5R6WxXDjg', NULL, '89057701747', 'Karabekov Rustam Zafarovich',
     NULL, NULL, NULL, NULL, NULL),
    
    ('AVITO-250329-8271', 'Аренда неделя', '27346317', '32704805', NULL, 'u2i-E2a5OY2rDQnGRqpTU1gjyQ', NULL, '79776059397', 'Ильяс',
     to_timestamp(1743195600), to_timestamp(1744578000), '4521402590', 'МОСКВА, Район, Улица ул. ГРИШИНА, 23, K. 2, KB. 17', '2025-04-07 17:43'),
    
    ('TG-250401-3681', 'Аренда неделя', '27379251', '32738959', '7724416787', NULL, NULL, '79168265161', 'Комилчон',
     to_timestamp(1743454800), to_timestamp(1744664400), '404032584', 'Москва ул. 3я владимирская д25 к2 кв194', '2025-04-07 17:03'),
    
    ('TG-250401-6431', 'Аренда 2 недели', '27380959', '32740639', '992690669', NULL, NULL, '79619681899', 'Евгений',
     to_timestamp(1743454800), to_timestamp(1744664400), '3019612015', '684000, Камчатский край, г Елизово, ул Паратунская, д 4, кв 1', '2025-04-01 15:35'),
    
    ('TG-250401-0683', 'Аренда неделя', '27380981', '32740655', '1795293789', NULL, NULL, '79854200770', 'ИВАН',
     to_timestamp(1743454800), to_timestamp(1744059600), '4521062214', 'Г. ХОСКВА', '2025-04-05 18:37'),
    
    ('AVITO-250403-7392', 'Аренда 2 недели', '27405769', '32850997', '7669172384', 'u2i-8dlW7dOsYKcdyuNobhH7Vg', NULL, '79912776471', 'Евгений',
     to_timestamp(1743800400), to_timestamp(1745010000), NULL, NULL, '2025-04-07 20:28'),
    
    ('TG-250403-8471', 'Аренда неделя', '27412131', '32857261', '6606229437', NULL, NULL, '79896049757', 'СЕРГЕЙ',
     to_timestamp(1743627600), to_timestamp(1744232400), '4523266933', 'г. Москва, ул. Тагильская, д. 4В, кв. 705', '2025-04-03 12:52'),
    
    ('TG-250404-3759', 'Аренда неделя', '27428889', '32897633', '7601971844', NULL, NULL, '79006427644', 'АСАДБЕК',
     to_timestamp(1743714000), to_timestamp(1744318800), '00608', 'КРАСНОД, ДОМ 13, СТРОЕНИЕ 2', NULL),
    
    ('AVITO-250405-2457', 'Аренда неделя', '27431181', '32899823', NULL, 'u2i-nKohdIX5neRDxfm3nBNLsA', NULL, '79911475615', 'Антон',
     to_timestamp(1743800400), to_timestamp(1744405200), '4524472494', 'г. Москва, ул. Проходчиков, д. 16, кв. 136', '2025-04-05 09:50'),
    
    ('TG-250405-3201', 'biweekly', '27435893', '32904343', '7669172384', NULL, NULL, '79911475615', 'Кушаков Евгений',
     NULL, NULL, '800000', 'ДОМ 26', NULL),
    
    ('TG-250405-5716', 'Аренда неделя', '27436245', '32904687', '672080516', NULL, NULL, '79850718511', 'Богдан',
     to_timestamp(1743800400), to_timestamp(1744405200), '5000890447', 'ГОР. МОСКВА', '2025-04-05 17:05'),
    
    ('TG-250406-4552', 'weekly', '27444981', '32912631', '7728625834', NULL, NULL, '79850718511', 'Санжарбек Мирзабоев',
     NULL, NULL, 'FA71', 'УЛ. ЮЖНОПОРТОВАЯ, ДОМ 7', NULL); 